Repository: mblwhoi/dla_oral_histories
Catalog: sites/all/modules/imagecache/translations/*.po
Languages: ar

source: Allow Upscaling
ar: اسمح بالتكبير

source: Let scale make images larger than their original size
ar: اسمح لأدات المقاس بجعل حجم الصورة أكبر من حجمها الأصلي

source: Yes
ar: نعم

source: No
ar: لا

source: <strong>Inside dimensions</strong>: Final dimensions will be less than or equal to the entered width and height. Useful for ensuring a maximum height and/or width.
ar: <strong>الأبعاد الداخلية</strong> : الأبعاد النهائية ستكون أصغر أو مساوية للطول و العرض المحددين. مفيدة لتحديد الطول و /أو العرض الأقصى.

source: <strong>Outside dimensions</strong>: Final dimensions will be greater than or equal to the entered width and height. Ideal for cropping the result to a square.
ar: <strong>الأبعاد الخارجية</strong> : الأبعاد النهائية ستكون أكبر أو مساوية للطول و العرض المحددين. مثالية لتأطير الناتج بشكل مربع.

source: Scale to fit
ar: غير الحجم بشكل متناسب

source: Inside dimensions
ar: الأبعاد الداخلية

source: Outside dimensions
ar: الأبعاد الخارجية

source: Width
ar: العرض

source: Enter a width in pixels or as a percentage. i.e. 500 or 80%.
ar: أدخل العرض بالبكسل أو بالنسبة المئوية على شكل 500 أو 80%.

source: Height
ar: الطول

source: Enter a height in pixels or as a percentage. i.e. 500 or 80%.
ar: أدخل الطول بالبكسل أو بالنسبة المئوية على شكل 500 أو 80%

source: X offset
ar: الموقع على محور X

source: Enter an offset in pixels or use a keyword: <em>left</em>, <em>center</em>, or <em>right</em>.
ar: أدخل المكان بالبكسل أو استعمل الكلمات المفتاحية <em>left</em>, <em>center</em> أو <em>right</em>.

source: Y offset
ar: الموقع على محور Y

source: Enter an offset in pixels or use a keyword: <em>top</em>, <em>center</em>, or <em>bottom</em>.
ar: أدخل الموقع بالبكسل أو استعمل الكلمات المفتاحية <em>left</em>, <em>center</em> أو <em>right</em>.

source: Rotation angle
ar: زاوية الدوران

source: The number of degrees the image should be rotated. Positive numbers are clockwise, negative are counter-clockwise.
ar: عدد الدرجات التي تريد تطبيقها لدوران الصورة. العدد الموجب يدير الصورة حسب عقارب الساعة و العدد السالب يدرها بعكس عقارب الساعة.

source: Randomize
ar: ولد بشكل عشوائي

source: Randomize the rotation angle for each image. The angle specified above is used as a maximum.
ar: ولد زاوية الدوران لكل صورة بشكل عشوائي. قيمة الزاوية المحددة فوق ستستخدم كحد أقصى,

source: Background color
ar: لون الخلفية

source: The background color to use for exposed areas of the image. Use web-style hex colors (#FFFFFF for white, #000000 for black).
ar: اللون الذي سيستخدم في المناطق المعروضة من الصورة. استعمل طريقة الويب في كتابة الألوان مثال : #FFFFFF للأبيض, #000000 للأسود.

source: degrees:
ar: درجة:

source: randomize:
ar: ولد بشكل عشوائي:

source: background:
ar: الخلفية:

source: <strong>NOTE:</strong> The sigma parameter below is currently <em>only</em> used when the Imagemagick toolkit is active.
ar: <strong>ملاحظة:</strong> الإعداد sigma أدناه يستعمل حالياً <em>فقط</em> عند تفعيل طقم الأدوات Imagemagick.

source: Radius
ar: نصف القطر

source: The radius of the gaussian, in pixels, not counting the center pixel. If you're using Imagemagick, you can set this to 0 to let Imagemagick select a suitable radius. Typically 0.5 to 1 for screen resolutions. (default 0.5)
ar: نصف قطر الغاوسي, في البكسيل, بغض النظر عن بكسيل المركز. إذا كنت تستخدم Imagemagick, تستطيع تحديد هذه القيمة على الصفر للسماح لـ Imagemagick باختيار القيمة المناسبة, عادة نستعمل قيمة بين 0.5 و 1 للشاشة( 0.5 هي القيمة الإفتراضية).

source: Sigma
ar: سيغما

source: The standard deviation of the gaussian, in pixels. General rule of thumb: if radius < 1 then sigma = radius, else sigma = sqrt(radius). (default 0.5)
ar: الانحراف المعياري للغاوسي, بالبكسيل. قاعدة عامة: إذا كان تصف القطر أصغر من 1 إذاً سيغما = نصف القطر, وأما غير ذلك فسيغما = الجذر التربيعي لنصف القطر (الافتراضي 0.5)

source: Amount
ar: مقدار

source: The percentage of the difference between the original and the blur image that is added back into the original. Typically 50 to 200. (default 100).
ar: النسبة المئوية للفرق بين الصورة الأصلية و الصورة المطمسة التي يتم إضافتها خلف هذه الصورة. عادة من 50 إلى 200 . (الافتراضي 100).

source: Threshold
ar: عتبة

source: The threshold, as a fraction of max RGB levels, needed to apply the difference amount. Typically 0 to 0.2. (default 0.05).
ar: العتبة, بشكل جزء صغير من مستويات الـRVB, مما هو مطلوب لتطبيق مقدار الفرق. القيمة النموذجية تكون بين 0 إلى 0.2 (الافتراضي 0.05)

source: radius:
ar: نصف القطر:

source: sigma:
ar: سيغما:

source: amount:
ar: مقدار:

source: threshold:
ar: عتبة:

source: imagecache_scale_image failed. image: %image, data: %data.
ar: فشل imagecache_scale_image. الصورة : %image, البيانات : %data.

source: imagecache_scale_and_crop failed. image: %image, data: %data.
ar: فشل imagecache_scale_and_crop. الصورة : %image, البيانات : %data.

source: imagecache_deprecated_scale failed. image: %image, data: %data.
ar: فشل imagecache_deprecated_scale. الصورة : %image, البيانات : %data.

source: imagecache_crop failed. image: %image, data: %data.
ar: فشل imagecache_crop. الصورة : %image, البيانات : %data.

source: imagecache_desaturate failed. image: %image, data: %data.
ar: فشل imagecache_desaturate. الصورة : %image, البيانات : %data

source: imagecache_rotate_image failed. image: %image, data: %data.
ar: فشل imagecache_rotate_image. الصورة : %image, البيانات : %data

source: imagecache_sharpen_image failed. image: %image, data: %data.
ar: فشل imagecache_rotate_image. الصورة : %image, البيانات : %data

source: @preset image
ar: صورة @preset

source: @preset image linked to node
ar: الصورة @preset تربط بالعقدة

source: @preset image linked to image
ar: الصورة @preset تربط بالصورة

source: @preset file path
ar: @preset مسار الملف

source: ImageCache already generating: %dst, Lock file: %tmp.
ar: ImageCache يولد بالفعل : %dst, ملف القفل : %tmp.

source: Failed generating an image from %image using imagecache preset %preset.
ar: فشل توليد الصورة من %image باستخدام قالب imagecache %preset.

source: non-existant action %action
ar: اجراء غير موجود %action

source: Failed to create imagecache directory: %dir
ar: فشل إنشاء دليل imagecache : %dir

source: action(id:%id): %action failed for %src
ar: الاجراء id:%id : فشل %action لاجل %src

source: Cached image file %dst already exists. There may be an issue with your rewrite configuration.
ar: ملف تخزين الصورة %dst موجود فعلاً. ربما هناك مشكلة في ضبط إعادة الكتابة.

source: Unknown file type(%path) stat: %stat
ar: نوع الملف غير معروف %path احصائيات : %stat

source: imagecache_resize_image failed. image: %image, data: %data.
ar: فشل imagecache_resize_image. الصورة : %image, معلومات : %data.

source: administer imagecache
ar: إدارة imagecache

source: flush imagecache
ar: تفريغ imagecache

source: view imagecache
ar: عرض imagecache

source: presetname
ar: اسم القالب

source: Manage ImageCache presets.
ar: إدارة قوالب ImageCache

source: Place the following snippet in your module as part of <code>hook_imagecache_default_presets()</code>.
ar: ضع الكود التالي قي الوحدة كجزء من <code>hook_imagecache_default_presets()</code>.

source: Preset Name
ar: اسم القالب

source: Storage
ar: المخزن

source: Actions
ar: الإجراءات

source: Default
ar: إفتراضي

source: View
ar: عرض

source: Flush
ar: تفريغ

source: Override
ar: تجاوز

source: Edit
ar: تحرير

source: Revert
ar: عودة

source: Export
ar: تصدير

source: Normal
ar: عادي

source: Delete
ar: حذف

source: Preset Namespace
ar: نطاف تسمية القالب

source: The namespace is used in URLs for images to tell imagecache how to process an image. Please only use alphanumeric characters, underscores (_), and hyphens (-) for preset names.
ar: يتم استعمال نطاق الاسم في بناء مسار الصورة لإخبار imagecache كيفية معالجة الصور. لتسمية القوالب استخدم فقط الأحرف و الأرقام, الخط الفاصل السفلي (_), و الخط الفاصل (-).

source: Create New Preset
ar: انشئ قالب جديد

source: Preset %name (ID: @id) was created.
ar: تم إنشاء القالب %name ID: @id .

source: The namespace you have chosen is already in use.
ar: نطاق الاسم المختار سبق و تم استعماله.

source: Please only use alphanumeric characters, underscores (_), and hyphens (-) for preset names.
ar: استحدم فقط الأحرف و الأرقام, الخط الفاصل السفلي (_), و الخط الفاصل (-), لتسمية القوالب.

source: The specified preset was not found
ar: لم يتم العثور على القالب المحدد

source: Are you sure you want to delete the preset %preset?
ar: هل تريد فعلاً حذف القالب %preset؟

source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الاجراء.

source: Cancel
ar: الغاء

source: Preset %name (ID: @id) was deleted.
ar: تم حذف القالب %name ID: @id.

source: Are you sure you want to flush the preset %preset?
ar: هل تريد فعلاً تفريغ القالب %preset؟

source: Preset %name (ID: @id) was flushed.
ar: تم تفريغ القالب %name ID: @id.

source: The specified preset was not found.
ar: لم يتم العثور على القالب المحدد.

source: The namespace is used in URL's for images to tell imagecache how to process an image. Please only use alphanumeric characters, underscores (_), and hyphens (-) for preset names.
ar: يتم استعمال نطاق الاسم في بناء مسار الصورة لإخبار imagecache كيفية معالجة الصور. لتسمية القوالب استخدم فقط الأحرف و الأرقام, الخط الفاصل السفلي (_), و الخط الفاصل (-).

source: Configure
ar: ضبط

source: New Actions
ar: اجراءات جديدة

source: Add !action
ar: إضافة !action

source: Override Defaults
ar: تجاهل القيم الافتراضية

source: Update Preset
ar: حدث القالب

source: Preview
ar: معاينة

source: Action
ar: اجراء

source: Settings
ar: اعدادات

source: Weight
ar: وزن

source: Unknown Action.
ar: اجراء غير معروف

source: Unknown Preset.
ar: قالب غير معروف

source: Update Action
ar: حدث الاجراء

source: The action was succesfully updated.
ar: تم تحديث الاجراء بنجاح

source: Unknown Action: @action_id
ar: اجراء غير معروف : @action_id

source: Are you sure you want to delete the !action action from preset !preset?
ar: هل تريد فعلاً حذف الاجراء !action من القالب !preset ؟

source: The action has been deleted.
ar: تم حذف الاجراء.

source: Add Action
ar: أضف اجراء

source: Administer imagecache presets and actions.
ar: يدير قوالب imagecache و الاجرأت

source: List
ar: سرد

source: Add new preset
ar: أضف قالب جديد

source: The primary identifier for an imagecache_preset.
ar: المعرف الأولي ل imagecache_preset.

source: The primary identifier for a node.
ar: المعرف الأولي للعقدة.

source: The primary identifier for an imagecache_action.
ar: المعرف الأولي ل imagecache_action.

source: The weight of the action in the preset.
ar: وزن هذا الاجراء في القالب.

source: The module that defined the action.
ar: الوحدة التي حددت هذا الاجراء.

source: The unique ID of the action to be executed.
ar: المعرف المميز (ID ) لهذا الاجراء ليتم تنفيذه.

source: The configuration data for the action.
ar: بيانات ضبط هذا الاجراء.

source: ImageCache Directory
ar: دليل ImageCache

source: %p does not a directory or is not readable by the webserver.
ar: %p لا يشكل دليل أو أنه غير قابل للقراءة من قبل خادم الويب.

source: %p is not writeable by the webserver.
ar: %p غير قابل للكتابة من قبل خادم الويب.

source: An unknown error occured.
ar: حدث خطأ غير معروف.

source: An unknown error occured trying to verify %p is a directory and is writable.
ar: حدث خطأ غير معروف تأكد بأن %p هو الدليل و أنه متاح للكتابة.

source: ImageCache Temp Directory
ar: الدليل المؤقت ل ImageCache

source: Dynamic image manipulator and cache.
ar: التخزين ومناور الصورة الديناميكية.

source: ImageCache User Interface.
ar: واجهة المستخدم ImageCache
